In [1]:
suppressPackageStartupMessages({
    library(tidyverse)
    library(ggplot2)
    library(palmerpenguins)
    library(lubridate)
})

In [2]:
penguins_df <- penguins
glimpse(penguins_df)

Rows: 344
Columns: 8
$ species           <fct> Adelie, Adelie, Adelie, Adelie, Adelie, Adelie, Adel~
$ island            <fct> Torgersen, Torgersen, Torgersen, Torgersen, Torgerse~
$ bill_length_mm    <dbl> 39.1, 39.5, 40.3, NA, 36.7, 39.3, 38.9, 39.2, 34.1, ~
$ bill_depth_mm     <dbl> 18.7, 17.4, 18.0, NA, 19.3, 20.6, 17.8, 19.6, 18.1, ~
$ flipper_length_mm <int> 181, 186, 195, NA, 193, 190, 181, 195, 193, 190, 186~
$ body_mass_g       <int> 3750, 3800, 3250, NA, 3450, 3650, 3625, 4675, 3475, ~
$ sex               <fct> male, female, female, NA, female, male, female, male~
$ year              <int> 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007, 2007~

## Data Cleaning

In [3]:
# Check the number of missing values
sum(is.na(penguins_df))

# Create subset dataframe containing rows with NA
penguins_df[apply(is.na(penguins_df), 1, any), ]

[1] 19

   species island    bill_length_mm bill_depth_mm flipper_length_mm body_mass_g
1  Adelie  Torgersen   NA             NA           NA                 NA
2  Adelie  Torgersen 34.1           18.1          193               3475
3  Adelie  Torgersen 42.0           20.2          190               4250
4  Adelie  Torgersen 37.8           17.1          186               3300
5  Adelie  Torgersen 37.8           17.3          180               3700
6  Adelie  Dream     37.5           18.9          179               2975
7  Gentoo  Biscoe    44.5           14.3          216               4100
8  Gentoo  Biscoe    46.2           14.4          214               4650
9  Gentoo  Biscoe    47.3           13.8          216               4725
10 Gentoo  Biscoe    44.5           15.7          217               4875
11 Gentoo  Biscoe      NA             NA           NA                 NA
   sex year
1  NA  2007
2  NA  2007
3  NA  2007
4  NA  2007
5  NA  2007
6  NA  2007
7  NA  2007
8  NA  2008
9  NA  2009
10 NA  2009
11 NA  2009

- **Rows to automatically remove**: First and last row is to be removed due to missing values in almost all variables (except for species, island and year)

- **Rows to investigate further**: All other rows have `NA` in the variable `sex`. These could be determined manually if there is a large difference in other dimensions.

Summarize the averages by species, island and sex

In [4]:
penguins_df %>%
    drop_na() %>%
    group_by(species, island, sex) %>%
    summarize(
        avg_bill_length = mean(bill_length_mm, na.rm = TRUE),
        avg_bill_depth = mean(bill_depth_mm, na.rm = TRUE),
        avg_flipper_length = mean(flipper_length_mm, na.rm = TRUE),
        avg_body_mass = mean(body_mass_g, na.rm = TRUE),
        .groups = "keep"
    )

   species   island    sex    avg_bill_length avg_bill_depth avg_flipper_length
1  Adelie    Biscoe    female 37.35909        17.70455       187.1818
2  Adelie    Biscoe    male   40.59091        19.03636       190.4091
3  Adelie    Dream     female 36.91111        17.61852       187.8519
4  Adelie    Dream     male   40.07143        18.83929       191.9286
5  Adelie    Torgersen female 37.55417        17.55000       188.2917
6  Adelie    Torgersen male   40.58696        19.39130       194.9130
7  Chinstrap Dream     female 46.57353        17.58824       191.7353
8  Chinstrap Dream     male   51.09412        19.25294       199.9118
9  Gentoo    Biscoe    female 45.56379        14.23793       212.7069
10 Gentoo    Biscoe    male   49.47377        15.71803       221.5410
   avg_body_mass
1  3369.318
2  4050.000
3  3344.444
4  4045.536
5  3395.833
6  4034.783
7  3527.206
8  3938.971
9  4679.741
10 5484.836

There is a large difference in body weight between males and females for each specie. Also, the species habitant (island) does not seem to impact the average weight significantly. Thus we can use these to determine the sex of the observations of interest.

In [5]:
# Fetch row indices containing NA
na_indicies <- which(apply(is.na(penguins_df), 1, any))
na_indicies

 [1]   4   9  10  11  12  48 179 219 257 269 272

In [6]:
# Assign sex based on body mass
penguins_df[9, ]$sex <-  "female"
penguins_df[10, ]$sex <- "male"
penguins_df[11, ]$sex <- "female"
penguins_df[48, ]$sex <- "female"
penguins_df[179, ]$sex <- "female"
penguins_df[219, ]$sex <- "female"
penguins_df[257, ]$sex <- "female"
penguins_df[269, ]$sex <- "female"

# Remove rows with excessive NAs
# and row 12 due to body mass being outlier
penguins_clean <- penguins_df[-c(4, 12, 272), ]

# Confirm if all NAs have been handled
sum(is.na(penguins_clean))

[1] 0

## Data Preperation: Tidy Data and Joining data

### Conditions:
1. Each variable must have its own column
2. Each observation must have its own row
3. Each value must have its own cell

### Example of a tidy dataset

In [7]:
table1

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

### Example: tidy a dataset using pivoting

In [8]:
 # Untidy due to
## 1. Columns 1999 and 2000 are values not variables
## 2. Values in the two columns are cases 
table4a

# Use pivot_longer() to tidy
table4a %>%
    pivot_longer(c(`1999`, `2000`), names_to = "year", values_to = "cases")

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

  country     year cases
1 Afghanistan 1999    745
2 Afghanistan 2000   2666
3 Brazil      1999  37737
4 Brazil      2000  80488
5 China       1999 212258
6 China       2000 213766

### Example: tidy two dataset and joining

In [9]:
# Untidy datasets
table4a
table4b

# tidy the two datasets using pivot_longer()
tidy4a <- table4a %>%
    pivot_longer(c(`1999`, `2000`), names_to = "year", values_to = "cases")

tidy4b <- table4b %>%
    pivot_longer(c(`1999`, `2000`), names_to = "year", values_to = "population")

# complete the data by joining them
left_join(tidy4a, tidy4b, by = join_by(country, year))

  country     1999   2000
1 Afghanistan    745   2666
2 Brazil       37737  80488
3 China       212258 213766

  country     1999       2000
1 Afghanistan   19987071   20595360
2 Brazil       172006362  174504898
3 China       1272915272 1280428583

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583

## Pivot Longer versus Pivot Wider
Use it when an observation is scattered across multiple rows.

### Example: when to pivot wider

In [10]:
table2

   country     year type       count
1  Afghanistan 1999 cases             745
2  Afghanistan 1999 population   19987071
3  Afghanistan 2000 cases            2666
4  Afghanistan 2000 population   20595360
5  Brazil      1999 cases           37737
6  Brazil      1999 population  172006362
7  Brazil      2000 cases           80488
8  Brazil      2000 population  174504898
9  China       1999 cases          212258
10 China       1999 population 1272915272
11 China       2000 cases          213766
12 China       2000 population 1280428583

- The column to to take variables names from is `type`
- The column to take values from is `count`

In [11]:
table2 %>%
    pivot_wider(names_from = type, values_from = count)

  country     year cases  population
1 Afghanistan 1999    745   19987071
2 Afghanistan 2000   2666   20595360
3 Brazil      1999  37737  172006362
4 Brazil      2000  80488  174504898
5 China       1999 212258 1272915272
6 China       2000 213766 1280428583